const errorMapping = {
  'reasonCode': {
    '303': '验证不通过',
    's000': '系统错误',
    's001': '找不到数据',
    's002': '记录已存在',
    // logon error
    's100': '帐号已被停用，请联系管理员',
    's101': '帐号已被停用，请联系管理员',
    's102': '请输入正确的帐号或密码',
    's103': '请输入正确的帐号或密码',
    's104': '原密码输入错误',
    's105': '验证码错误',
    // staff error
    's300': '帐号已存在',
    's301': '帐号已被删除',
    's444':'非法请求',
    // fee error
    'f002': '该城市该车型的费率已存在',
    // token error
    'u0003': '当前会话已过期，请重新登录',
    'u0005': '当前会话已过期，请重新登录',
    // message error
    'm001': '消息不存在',
    'm002': '上线的消息不能编辑',
    'm003': '上线的消息不能重复上线',
    'm004': '未上线的消息不能下线',
    // feedback error
    'fb001': '反馈信息找不到',
    // order error
    'o001': '订单不存在',
    // dirver error
    'sn001': '自营司机找不到',
    'sn002': '自营司机手机号重复',
    'sn003': '自营司机身份证号重复',
    'sn004': '自营司机车牌号重复',
    'sn005': '自营司机发动机号重复',
    'sn007':'运营中的车辆禁止编辑',
    // role error
    'sr001': '角色数据找不到',
    'sr002': '角色名称重复',
    'sr003': '角色编码重复',
    'sr004': '角色还在使用中，不能删除',
    // menu error
    'se001': '资源找不到',
    'se002': '资源名称重复',
    'se003': '资源编码重复',
    'se004': '父资源不存在',
    'se005': '存在子节点的资源不能删除，请先删除子节点',
    'se006': '资源树结构错误',
    //rider error
    'r0001': '当前状态不能进行此操作',
    // coupon error
    'cp001': '优惠券过期',
    // logistic error
    'ls001': '物流公司不存在',
    'll001': '物流专线不存在',
    'll002': '物流线路已存在',
    'ld001': '保证金不足'
  },
  'statusCode': {
    '400': '请求错误',
    '401': '未授权，请登录',
    '403': '拒绝访问',
    '404': '请求地址出错',
    '408': '请求超时',
    '500': '服务器内部错误',
    '501': '服务未实现',
    '502': '网关错误',
    '503': '服务不可用',
    '504': '网关超时',
    '505': 'HTTP版本不受支持'
  }
}

export default errorMapping
